package design.prototype.work.w5;

/**
 * 类描述：
 * 抽象原型类
 * @author cfl
 * @version 1.0
 * @date 2022/12/12 21:42
 */
public abstract class Prototype {
    //~fields
    //==================================================================================================================

    //~methods
    //==================================================================================================================

    /**
     * 克隆接口
     * @return
     */
    public abstract Prototype copy();
}
