package design.factory.method.work.w4;

/**
 * 类描述：
 * 汽车工厂-抽象工厂
 * @author cfl
 * @version 1.0
 * @date 2022/12/10 19:25
 */
public abstract class AbstractFactory {
    //~fields
    //==================================================================================================================

    //~methods
    //==================================================================================================================

    /**
     * 创建汽车工厂方法
     * @return
     */
    public abstract Car create();
}
