package design.factory.method.work.w4;

/**
 * 类描述：
 * 奔驰车-具体产品
 * @author cfl
 * @version 1.0
 * @date 2022/12/10 19:24
 */
public class BenzCar extends Car{
    //~fields
    //==================================================================================================================

    //~methods
    //==================================================================================================================

    public BenzCar() {
        System.out.println("生产一辆奔驰汽车");
    }
}
