package design.factory.method.work.w4;

/**
 * 类描述：
 * 宝马汽车-具体产品
 * @author cfl
 * @version 1.0
 * @date 2022/12/10 19:24
 */
public class BMWCar extends Car{
    //~fields
    //==================================================================================================================

    //~methods
    //==================================================================================================================

    public BMWCar() {
        System.out.println("生产一辆宝马汽车");
    }
}
